// Якщо умова ture то тіло виконується.Якщо false то тіло не виконується і інтерпритатор считує код який йде далі
if (5 > 5)
{
    console.log('Hello!');
}
console.log(5);

// ==========================================================================================

// розгалуження if...else
if (100 > 50){
    console.log('Перша умова виконана');
} else {
    console.log('Умова не виконана');
}
// ==========================================================================================
const wage = 5000;

if(wage > 1000){
    console.log('good');
}else {
    console.log('йди працюй');
}

// ==========================================================================================
// Оператор розгалууження else...if
// Якщщо salary > 1000 то рівень 1 і далі він код не читає бо йому не цікаво
const salary = 5000;

if(salary > 1000){
    console.log('Рівень 1');
} else if( salary > 2000){
    console.log('Рівень 2');
} else {
    console.log('Рівень 3');
}

// ==========================================================================================
// Якщо в нас в якійсь умові є false то тіло не викрнується і інтерпритатор читає код далі
const sallary = 5000;
        //  true                false
if (sallary >= 1000 && sallary < 2000){
    console.log('Рівень 1');
            //  true                false
} else if( sallary >= 2000 || sallary < 3000){
    console.log('Рівень 2');
} else {
    console.log('Рівень 3');
}
// Тернарний оператор-присвоєнння змінній значення по умові
// const balance = 1000;
// const massage = balance > 1 ? 'Ваш баланс позитивний' : 'Ваш баланс негативний';
// console.log(massage);

// ==========================================================================================
const balance = 1000;
let message;

if (balance > 1000) {
    message = 'Ваш баланс позитивний'
    console.log(message);
}
// приклад
const points = 80;
let massage = points > 90 ? "you rock!" : "you're looser";
console.log(massage);

// ==========================================================================================
const s = 5000;
    //    true        true
if (s >= 1000 || s < 1000) {
    console.log('weldone');
} else {
    console.log('bad');
}