// цикл for
// for (ініціалізація; умова; пост - вираз) {
// тіло циклу
// }

// let i = 9; - ініціалізація
// i <= 13; - умова(поставили рамки для циклу)
// i += 1; - кожна ітерація буде на кожну 1 додаватися

// ============================================================================
// i > 10 не спрацює бо нема конкретної умови бо це може бути і 51 і 384

// від 0 - 10 кожна ітерація буде збільшуватися на 1
// цей цикл перерветься коли i буде присвоєно значення 10

// for (let i = 0; i <= 10; i += 1){
//     console.log(i);
// }
// ============================================================================
// синтаксис

// while (вираз) {
//     тіло циклу (statement)
// }

let age = 0;
// while (age <= 18) {
//     age += 1
//     console.log(age);
// }

// у while ми вставляємо кордони скільки потрабно нам циклів

// ============================================================================
// do...while
// перша ітерація буде 100% виконуватися

// do {
// тіло
// } while (вираз);

do {
    age += 1
    console.log(age);
    } while (age <= 18);

// ============================================================================
// Напиши срипт який підраховує загальну суму зп працівників.
// Кількість робітників зберігається в зміннній employees
// Зп кожного працівника це випадкове число від 500 до 5000
// Записати суму в змінну totalSalary і в вивести в консоль
 
// 1. Створюємо змінні
const employees = 5;
const minSalary = 500;
const maxSalary = 5000;
const salary = Math.round(Math.random() * (maxSalary - minSalary) + minSalary);
// або
// const salary = Math.round(Math.random()  * (5000 - 500) + 500)
let totalSalary = 0;
// 2. Робимо цикл, проходимося по всім робітникам
for(let i = 1; i <= employees; i += 1){
    totalSalary += salary
    console.log(totalSalary);
}




// explanation
// 1. Кількість працівників не вказано тому ми будемо їх змінювати
// 2. totalSalary 0 томущо ми можемо присвоїти пустий рядок і 0 але при математисних обрахкнках ми маємо поставити 0 щоб було якесь початкове значення
// 3. Нам потрібно пройтися по кількості наших працівників тому i не повина бути більшою ніж employees
// 4. Ми записали const salary = Math.round щоб округлити рандомне число бо воно може бути 6.47845

// ============================================================================

//  Напиши скрипт який порахує суму всіх парних чисел,
//  які входять в діапазон чисел в змінних він min до max.
// Наприклад, якщо min = 0; і max = 5; тодіапазон 0-5, 
// і в ньому два парних числа - 2 та 4 - їхня сума 6

// 1. Створити змінні
const min = 0;
const max = 10;
let result = 0;
for(let i = min; i <= max; i += 1){
    // 2. Перевіряємо кожне число на залишок від ділення
    console.log();
}
// 3. Підсумовуємо результат






