// 19:50
// ==================================================================
// 1. створюємо змінні
const totall = 100;
const ordered = 50;
// 2. робимо розгалуження з умовою, ordered 
if (ordered > totall) {
    console.log('На складі недостатньо товарів');
} else if (totall < ordered) {
    console.log("Замовлення оформлено з вами зв'яжеться менеджер");
}
// ==================================================================
// Завдання
// 20:00
// 1.змінні 
// let input;
// let  total;
// 2. попросити у користувача вветси число і присвоїти це значення змінній input
// 3. запускаємо цикл з умовою input !== null
// 3. додати input до змінної total

let input;
let  total;
input = prompt('Введи число');
prompt('');