// ====================================================================================
// Цикл-допомагають зберігати колекцію однотипних даних
// Довжина масиву-кількість елементів в масиві
// console.table()-таблиця для зручності
// не застусовуємо let, бо ми не маємо права на прямуу змінювати масиви

// Синтаксис
// const array = [];
// console.log(array);

// ====================================================================================
const array = ['Mango', 'Kivi', 'Poly'];
console.table(array);
// Як дізначитись індекс останього елементу
// ми вписуємо -1 щоб в консолі нам показало число на якому стоїть останній елемент
const lastIndeex = array.length -1;
console.log(lastIndex);
// як звернутись до якогось елемента щоб щось з ним зробити
// щоб звернутись до 'Kivi' ми звертаємось до нього і вказуємо його індекс

array[1]  = 'Nick';
console.log(array[1]);
// ми вводимо console.table() - щоб подивтись на таблицю де ми пересвоїли значення 2-му елементу але можна не вказувати
// console.table(array);

// ====================================================================================
// Перебір (ітерація) масиву
// 1. for - якщо поьрібен індекс або потрібно змінити елемент масиву
// 2. for...of - яко індекс не потрібен і в масиві нічого змінювати
// Пояснення
// let 1 = 0;- індекс з якого буде все починатися
// console.log(i);- показує індекси елементів
// console.log(array[1]);- показує елементи по їхнім індексам
const array = ['Mango', 'Kivi', 'Poly', 'Ajax'];
const lastIndex = array.length -1;
for(let i = 0; i <= lastIndex; i += 1){
    console.log(i);
    console.log(array[1]);
} 


const arr = ['bmw', 'mercedes', 'audi', 'forzvagen', 'skoda'];
const lastInd = arr.length -1;
for(let i = 0; i <= lastInd; i += 1){
    console.log(arr[i]);
}
// =====================================================
// for...of
for (const iterator of object) {
    
}









// ====================================================================================
// Методи split() і join()
// ====================================================================================
// Методи indexOf() і includes()
// ====================================================================================
// Перевірка множинних умов з includes()
// ====================================================================================
// push і pop
// ====================================================================================
// shift() і unshift()
// ====================================================================================
// Метод slice()
// ====================================================================================
// Метод concat()
// ====================================================================================